01 BOOKING-RECORD.
   05 BKG-REF           PIC X(8).
   05 BKG-FLIGHT-ID     PIC X(6).
   05 BKG-PAX-ID        PIC X(8).
   05 BKG-SEAT          PIC X(4).
   05 BKG-DATE          PIC X(8).
   05 BKG-STATUS        PIC X(1).
   05 BKG-CLASS         PIC X(1).
   05 BKG-AMOUNT        PIC 9(7)V99.
